name: "parakeet_asr"
backend: "python"
max_batch_size: 8

input [
  {
    name: "AUDIO_B64"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "TRANSCRIPTION"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "EOU_DETECTED"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]

dynamic_batching {
  preferred_batch_size: [ 4, 8 ]
  max_queue_delay_microseconds: 50000
}